Repository: Daniel-KM/Omeka-S-module-BulkEdit
Catalog: language/*.po
Languages: fr

source: The command "gs" (ghostscript) will be used to convert pdf to images.
fr: La commande "gs" (ghostscript) sera utilisée pour convertir les pdf en images.

source: The command "pdftoppm" (poppler) will be used to convert pdf to images.
fr: La commande "pdftoppm" (poppler) sera utilisée pour convertir les pdf en images.

source: The command "gs" (ghostscript) is not available to convert pdf to images.
fr: La commande "gs" (ghostscript) n’est pas disponible pour convertir les pdf en images.

source: The command "pdftoppm" (poppler) is not available to convert pdf to images.
fr: La commande "pdftoppm" (poppler) n’est pas disponible pour convertir les pdf en images.

source: Unable to create temp directory "{dir}" for item #{item_id}.
fr: Impossible de créer le dossier temporaire « {dir} » pour le contenu #{item_id}.

source: Unable to create temp directory "{dir}" inside "/files" for resource #{resource_id}.
fr: Impossible de créer le dossier temporaire « {dir} » dans « /files » pour la ressource #{resource_id}.

source: Unable to read pdf #{media_id}.
fr: Impossible de lire le pdf #{media_id}.

source: Step 1/2 for item #{item_id}, pdf #{media_id}: Extracting pages as image.
fr: Étape 1/2 pour le contenu #{item_id}, pdf #{media_id} : extraction des pages en images.

source: Unable to extract images from item #{item_id} pdf #{media_id}.
fr: Impossible d’extraire les images du contenu #{item_id}, pdf #{media_id}.

source: For item #{item_id}, pdf #{media_id} cannot be exploded into images.
fr: Pour le contenu #{item_id}, le pdf #{media_id} ne peut pas être éclaté en images.

source: Step 2/2 for item #{item_id}, pdf #{media_id}: Creating {total} media.
fr: Étape 2/2 pour le contenu #{item_id}, pdf #{media_id} : création de {total} médias.

source: File cannot be saved in temporary directory "{dir}" (temp file: "{file}")
fr: Le fichier ne peut pas être enregistré dans le dossier temporaire « {dir} » (fichier : « {file} »)

source: Update media html: Invalid regex.
fr: Mise à jour des média html : regex incorrect.

source: An error occurred on resource #{resource_id} for html with preg_replace.
fr: Une erreur s’est produite sur la ressource #{resource_id} pour html avec preg_replace.

source: An error occurred on media #{media_id} (item #{item_id}) for source with preg_replace.
fr: Une erreur s’est produite sur le média #{media_id} (contenu #{item_id} pour la source avec preg_replace.

source: The provided uri "{uri}" is not trimmed.
fr: L’uri « {uri} » contient des espaces.

source: The label for uri "{uri}" is "{value}".
fr: Le libellé pour l’uri « {uri} » est « {value} ».

source: The label for uri "{uri}" was not found.
fr: Le libellé pour l’uri « {uri} » n’a pas été trouvé.

source: The provided label "{label}" is not trimmed.
fr: Le libellé fournie "{label}" n’est pas découpée.

source: Connection error when fetching url "{url}": {exception}
fr: Erreur de connexion pour l’url « {url} » : {exception}

source: Connection issue when fetching url "{url}": {message}
fr: Problème de connexion pour l’url « {url} » : {message}

source: Output is empty for url "{url}".
fr: La sortie est vide pour l’url « {url} ».

source: Output is not xml for url "{url}".
fr: La sortie n’est pas du xml pour l’url « {url} ».

source: Output is not a valid xml for url "{url}".
fr: La sortie n’est pas du xml valide pour l’url « {url} ».

source: The directory "{path}" is not writeable.
fr: Le dossier « {path} » n’est pas inscriptible.

source: The directory "{path}" is not writeable: {error}.
fr: Le dossier « {path} » n’est pas inscriptible : {error}.

source: Batch edit
fr: Traitement en lot

source: The actions are processed in the order of the form. Be careful when mixing them.
fr: Les traitements sont réalisés dans l’ordre du formulaire. Il convient de faire attention lorsque plusieurs traitements sont choisis.

source: To convert values to/from mapping markers, use module DataTypeGeometry.
fr: Pour convertir les valeurs depuis/vers les points sur les cartes, utiliser le module Data Type Geometry.

source: Processes that manage files and remote data can be slow, so it is recommended to process it in background with "batch edit all", not "batch edit selected".
fr: Les traitements avec les fichiers et les serveurs distants peuvent être lents. Il est donc recommandé de les lancer en arrière plan avec « Modifier tout » et non « Modifier sélectionnés ».
