Repository: Daniel-KM/Omeka-S-module-BulkEdit
Catalog: language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou supérieure.

source: The base uri is not set (key [file_store][local][base_uri]) in the config file of Omeka "config/local.config.php". It must be set for now (key [file_store][local][base_uri]) in order to process background jobs.
fr: L’uri de base n’est pas définie (clé [file_store][local][base_uri]) dans le fichier de configuration Omeka « config/local.config.php ». Il doit être indiqué pour l’instant (key [file_store][local][base_uri]) de façon à gérer les tâches en arrière-plan.

source: Cleaning
fr: Nettoyage

source: Replace values or uris
fr: Remplacer des valeurs ou des uris

source: Copy values
fr: Copier les valeurs

source: Displace values
fr: Déplacer des valeurs

source: Explode values
fr: Éclater des valeurs

source: Merge values as uri and label
fr: Fusionner les valeurs en tant qu’uri avec un libellé

source: Convert data type
fr: Conversion du type de données

source: Values order
fr: Tri des valeurs

source: Visibility of values
fr: Visibilité des valeurs

source: Fill and update metadata
fr: Remplir et mettre à jour les métadonnées

source: Fill labels or uris for Value Suggest
fr: Remplir les libellés ou les uris pour Value Suggest

source: Remove values, linked resources, or uris from a property
fr: Supprimer les valeurs, ressources liées ou les uris d’une propriété

source: Thumbnails
fr: Vignettes

source: Explode item by media
fr: Éclater les contenus par média

source: Explode pdf into jpeg for iiif viewers
fr: Éclater les pdf en images jpeg pour les visionneuses iiif

source: Remove media
fr: Supprimer le média

source: Media order
fr: Ordre des médias

source: Media HTML
fr: Média HTML

source: Media source
fr: Source du média

source: Media type (mime-type)
fr: Média-type (mime-type)

source: Visibility of medias
fr: Visibilité des médias

source: A new option was added to deduplicate values on save. It can be disabled in the main settings.
fr: Une nouvelle option a été ajoutée pour dédoublonner les valeurs lors de l’enregistrement. Elle peut être désactivée dans les paramètres généraux.

source: It’s now possible to convert any data type to any data type.
fr: Il est désormais possible de convertir tous les types de données.

source: It’s now possible to update or remove the owner of resources.
fr: Il est désormais possible de modifier ou de supprimer le propriétaire des ressources.

source: It’s now possible to get the Value Suggest uri from a label, when the remote endpoint returns a single result.
fr: Il est désormais possible de récupérer les uris Value Suggest à partir des libellés lorsque le service retourne un résultat unique.

source: It’s now possible to add thumbnails and to remove media from items.
fr: Il est désormais possible d’ajouter des vignettes et de supprimer des médias des contenus.

source: It’s now possible to update media source, in particular to keep only the base file name.
fr: Il est désormais possible de modifier la source du média, notamment pour conserver uniquement le chemin de base.

source: It’s now possible to replace the value or the language of any data type.
fr: Il est désormais possible de remplacer la valeur ou la langue de tous les types de données.

source: It’s now possible to convert badly Microsoft formatted values into standard Unicode (Windows issues like "Ã©" for "é").
fr: Il est désormais possible de convertir les valeurs incorrectement formatées par Microsoft en Unicode standard (problèmes Windows tels que « Ã© » pour « é »).

source: Cleaned params used for bulk edit: {json}
fr: Paramètres utilisés pour le traitement en lot : {json}

source: Deduplicated {count} values.
fr: {count} valeurs dédoublonnées.

source: Updated empty language of {count} values.
fr: Mise à jour de la langue vide dans {count} valeurs.

source: Updated language from "{from}" to "{to}" of {count} values.
fr: Mise à jour de la langue de « {from} » à « {to} » pour {count} valeurs.

source: Trimmed {count} values.
fr: Les espaces ont été nettoyés pour {count} valeurs.

source: Removed {count} empty string values after trimming.
fr: Suppression de {count} valeurs vides après nettoyage.

source: Updated empty values and uris of {count} values.
fr: Mise à jour des valeurs et des uris vides pour {count} valeurs.

source: Updated data type of {count} values.
fr: Mise à jour de {count} valeurs.

source: Trim property values
fr: Nettoyer les espaces dans les valeurs

source: Remove initial and trailing whitespace of all values of all properties
fr: Supprimer les espaces de début et de fin pour toutes les valeurs de toutes les propriétés

source: Specify data type "resource" for linked resources
fr: Préciser le type de données "resource" pour les ressources liées

source: In some cases, linked resources are saved in the database with the generic data type "resource", not with the specific "resource:item", "resource:media, etc.
fr: Dans certains cas, les ressources liées sont enregistrées dans la base avec le type de données générique "resource" et non avec le type spécifique "resource:item", resource:media", etc.

source: Set null for empty values or uris
fr: Mettre la valeur nulle pour les valeurs et les uris vides

source: Clean languages (set null when language is empty)
fr: Nettoyer la langue (indiquer nul quand la langue est vide)

source: Normalize or modify language codes
fr: Normaliser ou modifier les codes de langue

source: Normalize language codes from a code to another one, for example "fr" to "fra" or vice-versa. It allows to add or remove a code too.
fr: Normalise les codes de langue d’un code à un autre, par exemple de "fr" vers "fra", ou vice-versa. Il est aussi possible d’ajouter ou supprimer un code.

source: From code
fr: Depuis le code

source: To code
fr: Vers le code

source: For properties
fr: Pour les propriétés

source: [All properties]
fr: [Toutes les propriétés]

source: Deduplicate property values case insensitively
fr: Dédoublonner les valeurs des propriétés sans tenir compte de la casse

source: Deduplicate values of all properties, case INsensitively. Trimming values before is recommended, because values are checked strictly.
fr: Dédoublonner les valeurs de toutes les propriétés, sans tenir compte de la casse. Il est recommandé de nettoyer les espaces auparavant.

source: Part of value
fr: Élément de la valeur

source: Uri label
fr: Libellé de l’uri

source: Data type "literal"
fr: Type de donnée « textuel »

source: Replacement mode
fr: Mode de remplacement

source: No process
fr: Pas de traitement

source: Simple (case insensitive)
fr: Simple (insensible à la casse)

source: Simple and html entities
fr: Simple et entités html

source: Convert badly formatted characters from Microsoft to Unicode ("Ã©" to "é")
fr: Convertir les caractères incorrects Microsoft vers Unicode (« Ã© » en « é »)

source: Regex (full pattern)
fr: Regex (modèle complet)

source: Base name (last part of a file path or url)
fr: Nom de base (dernière partie d’un chemin ou d’une url)

source: Base name without extension
fr: Nom de fichier sans extension

source: Remove whole value
fr: Supprimer la valeur complète

source: String to replace
fr: Chaîne à remplacer

source: By
fr: Par

source: String to prepend
fr: Chaîne à préposer

source: String to append
fr: Chaîne à apposer

source: Set a language
fr: Choisir une langue

source: Remove language
fr: Supprimer la langue

source: From properties
fr: Depuis les propriétés

source: To property
fr: Vers la propriété

source: Only data types
fr: Seulement les types de données

source: [All data types]
fr: [Tous les types de données]

source: Only languages
fr: Seulement les langues

source: Only visibility
fr: Seulement la visibilité

source: Any
fr: Tous

source: Only containing
fr: Seulement contenant

source: Only matching regex
fr: Correspondant au regex

source: Change data type in new property (warning: this is not a conversion)
fr: Changer le type de données dans la nouvelle propriété (attention :ce n’est pas une conversion)

source: Select a data type…
fr: Choisir un type de données…

source: Copy only max number of values
fr: Copier seulement un nombre maximum de valeurs

source: Displace only max number of values
fr: Déplacer seulement un nombre maximum de valeurs

source: Separator
fr: Séparateur

source: Max number of values, from start or end (negative number)
fr: Nombre maximal de valeurs, depuis le début ou la fin (nombre négatif)

source: The values are merged two by two, whatever order and initial data type. The number of values must be even and clean.
fr: Les valeurs sont fusionnées deux par deux, quelque soient l’ordre et le type de données. Le nombre de données doit être pair.

source: From data type
fr: Depuis le type de données

source: Select data type
fr: Choisir un type de données

source: To data type
fr: Vers le type de données

source: Convert to literal: Content
fr: Conversion en texte : contenu

source: Label and uri
fr: Libellé et uri

source: Uri and label
fr: Uri et libellé

source: Label if present, else uri
fr: Libellé si présent, sinon uri

source: Label only
fr: Libellé seul

source: Uri only
fr: Uri seulement

source: Geonames to coordinates
fr: Géonames vers coordonnées

source: Select option
fr: Choisir une option

source: Convert to literal: keep only text from html/xml
fr: Conversion en texte : conserver uniquement le texte pour html/xml

source: Convert to html/xml: only html/xml-looking strings
fr: Conversion en html/xml : seulement les chaînes similaires à du html/xml

source: Convert to linked resource: Preprocess value
fr: Conversion en ressource liée : pré-traitement de la valeur

source: Use full value as identifier
fr: Utiliser la valeur complète en tant qu’identifiant

source: Use basename as identifier
fr: Utiliser le nom de base en tant qu’identifiant

source: Use basename without extension
fr: Utiliser le nom de fichier sans extension

source: Convert to linked resource: Properties where to search the identifier
fr: Conversion en ressource liée : propriétés dans lesquelles rechercher l’identifiant

source: Omeka internal id
fr: Id interne d’Omeka

source: Convert to uri: extract label after uri
fr: Conversion en uri : extraire le libellé après l’uri

source: Convert to uri: Label of uri
fr: Conversion en uri : libellé de l’uri

source: Convert to place: Language
fr: Conversion en lieu : langue

source: English
fr: Anglais

source: French
fr: Français

source: Convert to uri: Site to use as base url
fr: Conversion en uri : site pour l’url de base

source: Api url
fr: Url de l’api

source: Select a site
fr: Choisir un site

source: Order by language
fr: Trier par langue

source: List the language you want to order before other values.
fr: Lister les langues que vous voulez placer avant les autres valeurs.

source: Properties to order
fr: Propriétés à trier

source: Append or remove owner
fr: Ajouter ou supprimer le propriétaire

source: Remove owner
fr: Supprimer le propriétaire

source: Select a user…
fr: Choisir un utilisateur…

source: Fill mode
fr: Mode de remplissage

source: Fill missing labels of uris
fr: Remplir les libellés manquants des uris

source: Reset and fill all labels of uris
fr: Réinitialiser et remplir tous les libellés des uris

source: Remove labels of uris
fr: Supprimer les libellés des uris

source: Fill missing uri from labels
fr: Remplir les uris manquantes à partir des libellés

source: Reset and fill missing uri from labels
fr: Réinitialiser et remplir les uris à partir des libellés

source: The uri can be filled only when the remote endpoint returns a single result.
fr: L’uri peut être remplie seulement si le service retourne un résultat unique.

source: Data types to process
fr: Types de données à traiter

source: Literal
fr: Textuel

source: Data type to use when the value is literal or uri
fr: Type de données précis à utiliser quand la valeur est texte ou uri

source: Language code for querying and filling
fr: Code de langue pour rechercher et remplir

source: Update language in value
fr: Mettre à jour la langue dans la valeur

source: Keep
fr: Conserver

source: Use featured subject (Rameau)
fr: Utiliser les vedettes-matières (Rameau)

source: Only equal to
fr: Seulement égal à

source: Only containing string (text or uri)
fr: Seulement contenant la chaîne (texte ou uri)

source: Keep a number of values and remove first or next ones (positive or negative number)
fr: Conserver un nombre de valeurs et supprimer le premier ou les suivants (nombre positif ou négatif)

source: Remove first or last values (positive or negative number)
fr: Supprimer les premières ou les dernières valeurs (nombre positif ou négatif)

source: What to do with media metadata
fr: Que faire avec les métadonnées du média

source: Attach the thumbnail to all resources
fr: Joindre la vignette à toutes les ressources

source: Attach the thumbnail only if the resource has no thumbnail
fr: Attacher la vignette seulement si la ressource n’a pas de vignette

source: Attach the thumbnail only if the resource has no primary media
fr: Attacher la vignette seulement si la ressource n’a pas de média principal

source: Attach the thumbnail only if the resource has no thumbnail and no primary media
fr: Attacher la vignette seulement si la ressource n’a pas de vignette et pas de média principal

source: Attach the thumbnail only if the resource has already a thumbnail
fr: Attacher la vignette seulement si la ressource a déjà une vignette

source: Remove the specified thumbnail only if the resource has it
fr: Supprimer la vignette spécifiée uniquement si la ressource en possède une

source: Remove any thumbnail if the resource has a primary media
fr: Supprimer toute vignette si la ressource a un média principal

source: Remove any thumbnail from all resources
fr: Supprimer la vignette de toutes les ressources

source: Asset to attach as thumbnail
fr: Fichier à joindre en tant que vignette

source: Check first in jobs and logs that there is no background process working on medias, for example data extraction or indexation.
fr: Vérifiez d’abord dans les tâches et dans les journaux qu’aucun traitement n’est en cours dans les médias, par exemple des extractions ou des indexations.

source: Append media metadata to item metadata
fr: Ajouter les métadonnées du média aux métadonnées du contenu

source: Replace item metadata by media metadata when set
fr: Remplacer les métadonnées du contenu par les métadonnées du média quand elles existent

source: Remove all item metadata and replace them by media ones
fr: Supprimer toutes les données du contenu et les remplacer par celles du média

source: Do not copy media metadata and keep them in media
fr: Ne pas copier les métadonnées du média et les conserver dans le média

source: Process mode
fr: Mode de traitement

source: All pdf of each item
fr: Tous les pdf de chaque contenu

source: First pdf only
fr: Seulement le premier pdf

source: Last pdf only
fr: Seulement le dernier pdf

source: Creation process
fr: Type de traitement

source: All pages
fr: Toutes les pages

source: Skip existing pages (same created file name)
fr: Ignorer les pages déjà existantes (même nom de fichier)

source: Resolution, generally 72, 96, 150, 300, 400 (default), 600 or more
fr: La résolution, généralement 72, 96, 150, 300, 400 (défaut), 600 ou plus

source: Processor
fr: Processeur

source: Limited with media types below
fr: Limiter aux types de médias ci-dessous

source: Limited with media extensions below
fr: Limiter aux extensions de fichier ci-dessous

source: All medias
fr: Tous les médias

source: List of media types to remove
fr: Liste des types de médias à supprimer

source: Select media-types
fr: Choisir des types de médias

source: List of extensions to remove
fr: Liste des extensions à supprimer

source: replace
fr: remplacer

source: By title
fr: Par titre

source: By original source full name
fr: Par le nom de la source originale complète

source: By original source basename
fr: Par le nom de fichier source original

source: By media type
fr: Par type de média

source: By extension
fr: Par extension

source: By media type then title
fr: Par type de média puis par titre

source: By media type then source
fr: Par type de média puis par source

source: By media type then source basename
fr: Par type de média puis le nom de fichier source

source: By title then media type
fr: Par titre puis par type de média

source: By source then media type
fr: Par source puis par type de média

source: By source basename then media type
fr: Par le nom de fichier source puis par le type de média

source: By extension then title
fr: Par extension puis par le titre

source: By extension then source
fr: Par extension puis par la source

source: By extension then source basename
fr: Par extension puis par le nom de fichier source

source: By title then extension
fr: Par le titre puis par l’extension

source: By source then extension
fr: Par la source puis par l’extension

source: By source basename then extension
fr: Par le nom de fichier source puis par l’extension

source: List of media types to order first
fr: Types de médias à trier en premier

source: List of extensions to order first
fr: Extensions à trier en premier

source: Remove whole html
fr: Supprimer le html complet

source: Remove whole source
fr: Supprimer la source complète

source: Media type to replace
fr: Média-type à remplacer

source: By a valid media-type
fr: Par un média-type valide

source: Limit to media types
fr: Limiter aux média-types

source: All media types
fr: Tous les types de média

source: Limit to ingesters
fr: Limiter aux ingéreurs

source: All ingesters
fr: Tous les ingéreurs

source: Limit to renderers
fr: Limiter aux gestionnaires de rendu

source: All renderers
fr: Tous les gestionnaires de rendu

source: Bulk Edit
fr: Édition en lot

source: resources
fr: ressources

source: Deduplicate values on save
fr: Dédoublonner les valeurs lors de l’enregistrement

source: Argument "wrap" of method %1$s must be a null or alphanumeric string, received unstringable object "%2$s".
fr: L’argument « wrap » de la méthode %1$s doit être nul ou une chaîne alphanumérique et non l’objet « %2$s ».

source: Argument "wrap" of method %1$s must be a null or alphanumeric string, received "%2$s".
fr: L’argument « wrap » de la méthode %1$s doit être nul ou une chaîne alphanumérique et non « %2$s ».

source: The replacement of part of the value "{value_part}" is not supported.
fr: Le remplacement de la partie « {value_part} » de la valeur n’est pas pris en charge.

source: The mode of replacement "{mode}" is not supported.
fr: Le mode de remplacement « {mode} » n’est pas pris en charge.

source: An error occurred on resource #{resource_id} for property {property} with preg_replace.
fr: Une erreur est survenue pour la ressource #{resource_id}, propriété « {property} », avec preg_replace.

source: A conversion requires valid "from" dataType and "to" dataType.
fr: Une conversion nécessite des types de données corrects pour "depuis" et "vers".

source: A conversion from data type "{datatype_1}" to "{datatype_2}" requires the module Bulk Import.
fr: La conversion du type de données « {datatype_1} » en « {datatype_2} » nécessite le module Bulk Import.

source: To convert into the data type "{datatype}", the properties where to find the identifier should be set.
fr: Pour convertir vers le type de données « {datatype} », il convient de définir les propriétés dans lesquelles trouver l’identifiant.

source: The conversion from data type "{datatype_1}" to "{datatype_2}" requires a site or api to create the url.
fr: La conversion du type de données « {datatype_1} » en « {datatype_2} » nécessite un site ou l’api pour créer l’url.

source: No linked resource found for resource #{resource_id}, property "{property}", value resource #{linked_resource_id}.
fr: Aucune ressource liée trouvée pour la ressource #{resource_id}, propriété « {property} », valeur ressource #{linked_resource_id}.

source: For resource #{resource_id}, property "{property}", the linked resource #{linked_resource_id} is not a {resource_type}, but a {resource_name}.
fr: Pour la ressource #{resource_id}, propriété « {property} », la ressource liée #{linked_resource_id} n’est pas un {resource_type}, mais un {resource_name}.

source: No linked resource found with properties {properties} for resource #{resource_id}, property "{property}", identifier "{identifier}".
fr: Aucune ressource liée trouvée pour les propriétés {properties} pour la ressource #{resource_id}, propriété « {property} », identifiant « {identifier} ».

source: For resource #{resource_id}, property "{property}", the uri "{uri}" do not return a valid place.
fr: Pour la ressource #{resource_id}, propriété « {property} », l’uri « {uri} » ne retourne pas un lieu valide.

source: For resource #{resource_id}, property "{property}", the uri "{uri}" do not return a record.
fr: Pour la ressource #{resource_id}, propriété « {property} », l’uri « {uri} » ne retourne pas de notice.

source: For resource #{resource_id}, property "{property}", the value "{uri}" is not a resource url.
fr: Pour la ressource #{resource_id}, propriété « {property} », la valeur « {uri} » n’est pas une url de ressource.

source: Conversion from data type "{datatype_1}" to "{datatype_2}" is not possible in resource #{resource_id}: {value} => {value_2}
fr: La conversion du type de données « {datatype_1} » en « {datatype_2} » n’est pas possible dans la ressource #{resource_id} pour la valeur : {value} => {value_2}

source: Conversion from data type "{datatype_1}" to "{datatype_2}" is not possible in resource #{resource_id} for value: {value}
fr: La conversion du type de données « {datatype_1} » en « {datatype_2} » n’est pas possible dans la ressource #{resource_id} pour la valeur : {value}

source: Process is skipped: mode "{mode}" is unmanaged
fr: Le traitement est ignoré : le mode « {mode} » n’est pas géré

source: When "literal" or "uri" is used, the precise dataType should be specified.
fr: Quand « texte » ou « uri » est utilisé, un type de données précis doit être indiqué.

source: When filling an uri, the precise dataType should be specified.
fr: Quand une uri est saisie, le type de données précis doit être indiqué.

source: When filling an uri, the module Value Suggest should be available.
fr: Quand une uri est remplie, le module Value Suggest doit être disponible.

source: The options "max values" and "keep number of values" cannot be used at the same time.
fr: Les options "valeurs maximum" et "conserver un nombre de valeurs" ne peuvent pas être utilisées en même temps.

source: The mode "{mode}" is invalid.
fr: Le mode « {mode} » est incorrect.

source: The asset is missing.
fr: Le fichier est manquant.

source: The select mode "{mode}" is not supported.
fr: Le mode de sélection "{mode}" n’est pas pris en charge.

source: The select mode "Media types" require to specify at least one media type.
fr: Le mode de sélection "Types de médias" nécessite de spécifier au moins un type de média.

source: The select mode "Extensions" require to specify at least one extension.
fr: Le mode de sélection "Extensions" nécessite de spécifier au moins une extension.

source: Order "{order}" is invalid.
fr: Le tri « {order} » est incorrect.

source: Item #{item_id} cannot be exploded: {message}
fr: Le contenu #{item_id} ne peut pas être éclaté : {message}

source: Ghostscript is not available.
fr: Ghostscript n’est pas disponible.

source: The command "pdftoppm" (poppler) or "gs" (ghostscript) should be available to convert pdf to images.
fr: La commande "pdftoppm" (poppler) ou "gs" (ghostscript) devrait être disponible pour convertir les pdf en images.
